layers {
  bottom: "data"
  top: "conv1"
  name: "conv1"
  type: CONVOLUTION
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    stride: 1
  }
}
layers {
  bottom: "conv1"
  top: "conv1"
  name: "relu1"
  type: RELU
}
layers {
  bottom: "conv1"
  top: "pool1"
  name: "pool1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  bottom: "pool1"
  top: "conv2"
  name: "conv2"
  type: CONVOLUTION
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
  }
}
layers {
  bottom: "conv2"
  top: "conv2"
  name: "relu2"
  type: RELU
}
layers {
  bottom: "conv2"
  top: "pool2"
  name: "pool2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  bottom: "pool2"
  top: "conv3"
  name: "conv3"
  type: CONVOLUTION
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
  }
}
layers {
  bottom: "conv3"
  top: "conv3"
  name: "relu3"
  type: RELU
}
layers {
  bottom: "conv3"
  top: "fc6"
  name: "fc6_conv"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 8
  }
  inner_product_param {
    num_output: 512
  }
}
layers {
  bottom: "fc6"
  top: "fc6"
  name: "relu6"
  type: RELU
}
layers {
  bottom: "conv1"
  top: "conv1_pool"
  name: "conv1_pool"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 19
    stride: 19
  }
}
layers {
  bottom: "conv2"
  top: "conv2_pool"
  name: "conv2_pool"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 10
    stride: 10
  }
}
layers {
  bottom: "conv3"
  top: "conv3_pool"
  name: "conv3_pool"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 5
    stride: 5
  }
}
layers {
  bottom: "fc6"
  top: "fc6_pool"
  name: "fc6_pool"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 4
    stride: 4
  }
}
input: "data"
input_dim: 64
input_dim: 3
input_dim: 150
input_dim: 150
